// JavaScript Document
var R_format_type = {'1':'50', '2':'90', '3':'130', '4':'160'};

var E_format_type = {
	'1':{'E':'60x90 см', 'U':'8'}
	, '2':{'E':'60x90 см', 'U':'6'}
	, '3':{'E':'60x90 см', 'U':'4'}
	, '4':{'E':'60x90 см', 'U':'3'}
	, '5':{'E':'60x90 см', 'U':'2'}
	, '6':{'E':'60x90 см', 'U':'1'}
	
	, '7':{'E':'64x94 см', 'U':'8'}
	, '8':{'E':'64x94 см', 'U':'6'}
	, '9':{'E':'64x94 см', 'U':'4'}
	, '10':{'E':'64x94 см', 'U':'3'}
	, '11':{'E':'64x94 см', 'U':'2'}
	, '12':{'E':'64x94 см', 'U':'1'}
	
	, '13':{'E':'70x100 см', 'U':'8'}
	, '14':{'E':'70x100 см', 'U':'6'}
	, '15':{'E':'70x100 см', 'U':'4'}
	, '16':{'E':'70x100 см', 'U':'3'}
	, '17':{'E':'70x100 см', 'U':'2'}
	, '18':{'E':'70x100 см', 'U':'1'}
};

var Q_format_type = {
    '1':{'T':'38', 'Y':'20'}
    , '2':{'T':'50', 'Y':'35'}
    , '3':{'T':'62', 'Y':'50'}
    , '4':{'T':'74', 'Y':'65'}
    , '5':{'T':'86', 'Y':'80'}
    , '6':{'T':'98', 'Y':'95'}
    , '7':{'T':'110', 'Y':'110'}
    , '8':{'T':'122', 'Y':'125'}
    , '9':{'T':'134', 'Y':'140'}
    , '10':{'T':'146', 'Y':'155'}
    , '11':{'T':'158', 'Y':'170'}
    , '12':{'T':'170', 'Y':'185'}
    , '13':{'T':'182', 'Y':'200'}
    , '14':{'T':'194', 'Y':'215'}
    , '15':{'T':'206', 'Y':'230'}
    , '16':{'T':'218', 'Y':'245'}
};

var F_format_type = {
'1':{'1':'0.15', '2':'0.16', '3':'0.19'}
, '2':{'1':'0.16', '2':'0.17', '3':'0.21'}
, '3':{'1':'0.18', '2':'0.19', '3':'0.24'}
, '4':{'1':'0.21', '2':'0.22', '3':'0.27'}
, '5':{'1':'0.24', '2':'0.25', '3':'0.31'}
, '6':{'1':'0.27', '2':'0.29', '3':'0.35'}
, '7':{'1':'0.32', '2':'0.34', '3':'0.41'}
, '8':{'1':'0.40', '2':'0.43', '3':'0.52'}
, '9':{'1':'0.49', '2':'0.52', '3':'0.63'}
, '10':{'1':'0.10', '2':'0.11', '3':'0.13'}
, '11':{'1':'0.11', '2':'0.12', '3':'0.15'}
, '12':{'1':'0.13', '2':'0.14', '3':'0.18'}
, '13':{'1':'0.21', '2':'0.21', '3':'0.25'}
, '14':{'1':'0.29', '2':'0.29', '3':'0.35'}
, '15':{'1':'0.09', '2':'0.09', '3':'0.12'}
, '16':{'1':'0.13', '2':'0.13', '3':'0.17'}
, '17':{'1':'0.56', '2':'0.56', '3':'0.56'}
};

var J_format_type = {
'1':{'PAPER':'0.10', 'X':'10'}
, '2':{'PAPER':'0.12', 'X':'10'}
, '3':{'PAPER':'0.20', 'X':'10'}
, '4':{'PAPER':'0.24', 'X':'15'}
, '5':{'PAPER':'0.28', 'X':'15'}
, '6':{'PAPER':'0.26', 'X':'15'}
, '7':{'PAPER':'0.48', 'X':'15'}
, '8':{'PAPER':'0.46', 'X':'15'}
, '9':{'PAPER':'0.62', 'X':'130'}
, '10':{'PAPER':'0.86', 'X':'196'}
};

var W_format_type = {
	'1':{'PAPER':'0.08'}
	, '2':{'PAPER':'0.07'}
	, '3':{'PAPER':'0.06'}
	, '4':{'PAPER':'0.05'}
	, '5':{'PAPER':'50'}
	, '6':{'PAPER':'100'}
};






function build_calculator(params) {
/*
total = ((хартия*Z) + (печат*Z) + (покритие*Z) + (дов. работи*Z))

(((Q/U)+R)/4)*F = хартия							
((B+C)*T)+D = печат							
(((Q/U)+(R/3))*J)+X = покритие							
(K*Y)+(((Q*(L+M))*0,01)+((L+M)*4)) = дов. работи							
N = щанцоване (според формулата)							
О+P = предпечат							

*/
	var paper = 0;
	var p_print = 0;
	var p_cover = 0;
	var dov_rab = 0;
	var pred_pechat = 0;

	paper = (	(((params['Q']/params['U'])+params['R'])/4)*params['F']	);
	p_print = (	((params['B']+params['C'])*params['T'])+params['D']	);
	p_cover =  (	(((params['Q']/params['U'])+(params['R']/3))*params['J'])+params['X']	);
//	dov_rab = (	(((params['Q']*(params['L']+params['M']))*0.01)+((params['L']+params['M'])*4))	);
	dov_rab = ( (params['K']*params['Y']) +	(((params['Q']*(params['L']+params['M']))*0.01)+((params['L']+params['M'])*4))	);
	pred_pechat = (params['O']+params['P']);
	
	
	

	var total_sum = ((p_print*params['Z']) + (paper*params['Z']) +(p_cover*params['Z']) +(dov_rab*params['Z']) + (params['N']*params['Z']) +pred_pechat);
	//(ОБЩО ПЕЧАТ *Z)+(ОБЩО ХАРТИЯ  *Z)+(ОБЩО ПОКРИТИЕ *Z)+(ОБЩО ДОВ. РАБОТА *Z)+(ОБЩО ЩАНЦОВАНЕ*Z)+ОБЩО ПРЕДПЕЧАТ
	
	
	var singel_sum = total_sum/params['Q'];
	var vat_sum = (((20.0+100)/100)*total_sum);
	
	$('#single_sum').html(roundNumber(singel_sum, 2)+' лв/бр');
	$('#sum_total').html(roundNumber(total_sum, 2)+' лв');
	$('#sum_vat_total').html(roundNumber(vat_sum, 2)+' лв');

return false;
//	add_msg(html,MSG_SUCCESS);
}//build_calculator


function roundNumber(num, dec) {
	var result = Math.round(num*Math.pow(10,dec))/Math.pow(10,dec);
	if(result.toString().indexOf(".") == -1) result = result+'.00';
	

	return result; //parseFloat(result);
//		return num;
}
