// JavaScript Document
var A_format_type = {
	'1':{'S':'1', 'T':'2'}
	, '2':{'S':'1', 'T':'4'}
	, '3':{'S':'1', 'T':'8'}
	, '4':{'S':'2', 'T':'2'}
	, '5':{'S':'2', 'T':'4'}
	, '6':{'S':'2', 'T':'8'}
	, '7':{'S':'3', 'T':'2'}
	, '8':{'S':'3', 'T':'4'}
	, '9':{'S':'3', 'T':'8'}
	, '10':{'S':'4', 'T':'2'}
	, '11':{'S':'4', 'T':'4'}
	, '12':{'S':'4', 'T':'8'}
};

var R_format_type = {'1':'50', '2':'90', '3':'130', '4':'160'};

var V_format_type = {
	'1':{'V':'20'}
	, '2':{'V':'27'}
	, '3':{'V':'34'}
	, '4':{'V':'41'}
	, '5':{'V':'48'}
	, '6':{'V':'55'}
	, '7':{'V':'62'}
	, '8':{'V':'69'}
	, '9':{'V':'76'}
	, '10':{'V':'83'}
	, '11':{'V':'90'}
	, '12':{'V':'97'}
	, '13':{'V':'104'}
	, '14':{'V':'111'}
	, '15':{'V':'118'}
	, '16':{'V':'125'}
}; 

var E_format_type = {
    '1':  {'1': '0.12', '2': '0.12', '3': '0.13', '4': '0.16'},
    '2':  {'1': '0.13', '2': '0.13', '3': '0.14', '4': '0.17'},
    '3':  {'1': '0.15', '2': '0.15', '3': '0.16', '4': '0.20'},
    '4':  {'1': '0.17', '2': '0.17', '3': '0.19', '4': '0.23'},
    '5':  {'1': '0.20', '2': '0.20', '3': '0.21', '4': '0.26'},
    '6':  {'1': '0.23', '2': '0.23', '3': '0.24', '4': '0.29'},
    '7':  {'1': '0.27', '2': '0.16', '3': '0.29', '4': '0.35'},
    '8':  {'1': '0.33', '2': '0.33', '3': '0.36', '4': '0.43'},
    '9':  {'1': '0.40', '2': '0.40', '3': '0.43', '4': '0.52'},
    '10': {'1': '0.47', '2': '0.47', '3': '0.50', '4': '0.61'},
    '11': {'1': '0.08', '2': '0.08', '3': '0.09', '4': '0.11'},
    '12': {'1': '0.09', '2': '0.10', '3': '0.10', '4': '0.13'},
    '13': {'1': '0.11', '2': '0.12', '3': '0.13', '4': '0.16'},
    '14': {'1': '0.17', '2': '0.18', '3': '0.19', '4': '0.24'},
    '15': {'1': '0.22', '2': '0.23', '3': '0.25', '4': '0.30'},
    '16': {'1': '0.07', '2': '0.08', '3': '0.09', '4': '0.10'},
    '17': {'1': '0.10', '2': '0.11', '3': '0.11', '4': '0.14'},
    '18': {'1': '0.54', '2': '0.54', '3': '0.54', '4': '0.54'}
};

var F_format_type = {
	'0':{'F':'0', 'X':'0'}
	, '1':{'F':'0.03', 'X':'0'}
	, '2':{'F':'0.06', 'X':'0'}
	, '3':{'F':'0.06', 'X':'0'}
	, '4':{'F':'0.11', 'X':'0'}
	, '5':{'F':'0.08', 'X':'0'}
	, '6':{'F':'0.06', 'X':'0'}
	, '7':{'F':'0.16', 'X':'0'}
	, '8':{'F':'0.12', 'X':'0'}
	, '9':{'F':'0.18', 'X':'55'}
	, '10':{'F':'0.36', 'X':'110'}
};

var W_format_type = {
	'1':{'W':'20'}
	, '2':{'W':'27'}
	, '3':{'W':'34'}
	, '4':{'W':'41'}
	, '5':{'W':'48'}
	, '6':{'W':'55'}
	, '7':{'W':'62'}
	, '8':{'W':'69'}
	, '9':{'W':'76'}
	, '10':{'W':'83'}
	, '11':{'W':'90'}
	, '12':{'W':'97'}
	, '13':{'W':'104'}
	, '14':{'W':'111'}
	, '15':{'W':'118'}
	, '16':{'W':'125'}
}; 

var U_format_type = {'1':'50', '2':'90', '3':'130', '4':'160'};

var K_format_type = {
	'1':{'1':'0.11', '2':'0.11', '3':'0.12', '4':'0.14'}
	,'2':{'1':'0.12', '2':'0.12', '3':'0.13', '4':'0.15'}
	,'3':{'1':'0.14', '2':'0.14', '3':'0.15', '4':'0.18'}
	,'4':{'1':'0.16', '2':'0.16', '3':'0.17', '4':'0.2'}
	,'5':{'1':'0.18', '2':'0.18', '3':'0.2', '4':'0.23'}
	,'6':{'1':'0.2', '2':'0.2', '3':'0.22', '4':'0.26'}
	,'7':{'1':'0.24', '2':'0.24', '3':'0.26', '4':'0.3'}
	,'8':{'1':'0.3', '2':'0.3', '3':'0.34', '4':'0.39'}
	,'9':{'1':'0.36', '2':'0.36', '3':'0.45', '4':'0.55'}
	,'10':{'1':'0.067', '2':'0.075', '3':'0.083', '4':'0.097'}
	,'11':{'1':'0.079', '2':'0.085', '3':'0.095', '4':'0.11'}
	,'12':{'1':'0.1', '2':'0.106', '3':'0.138', '4':'0.138'}
	,'13':{'1':'0.21', '2':'0.21', '3':'0.21', '4':'0.21'}
	,'14':{'1':'0.27', '2':'0.27', '3':'0.27', '4':'0.27'}
	,'15':{'1':'0.052', '2':'0.056', '3':'0.069', '4':'0.069'}
	,'16':{'1':'0.075', '2':'0.08', '3':'0.102', '4':'0.102'}
	,'17':{'1':'0.51', '2':'0.51', '3':'0.51', '4':'0.51'}
};

var L_format_type = {
	'0':{'L':'0','XX':'0'}
	, '1':{'L':'0.06','XX':'0'}
	, '2':{'L':'0.11','XX':'0'}
	, '3':{'L':'0.16','XX':'0'}
	, '4':{'L':'0.12','XX':'0'}
	, '5':{'L':'0.36','XX':'110'}
};

var M_format_type = {
	'1':{'2':'0.18','4':'0.16','8':'0.14'}
	, '2':{'2':'0.2','4':'0.17','8':'0.15'}
};
		
var FM_ofset = {
	'1':{'FM':'1'}
	,'2':{'FM':'1'}
	,'3':{'FM':'1'}
	,'4':{'FM':'1'}
	,'5':{'FM':'1'}
	,'6':{'FM':'2'}
	,'7':{'FM':'2'}
	,'8':{'FM':'2'}
	,'9':{'FM':'2'}
	,'10':{'FM':'1'}
	,'11':{'FM':'1'}
	,'12':{'FM':'1'}
	,'13':{'FM':'1'}
	,'14':{'FM':'2'}
	,'15':{'FM':'1'}
	,'16':{'FM':'1'}
	,'17':{'FM':'2'}
};
	
/*
Дигитален печат струтури
*/
var B1_format_type = {
	'1':{'1':'0.17', '2':'0.41'}
	, '2':{'1':'0.16', '2':'0.37'}
	, '3':{'1':'0.15', '2':'0.35'}
	, '4':{'1':'0.14', '2':'0.3'}
};

var C1_format_type = {
	 '1':{'0':'0', '1':'0.17', '2':'0.41'}
	, '2':{'0':'0', '1':'0.16', '2':'0.37'}
	, '3':{'0':'0', '1':'0.15', '2':'0.35'}
	, '4':{'0':'0', '1':'0.14', '2':'0.3'}
};
				
var F1_format_type = {
	'0':{'F':'0', 'X':'0'}
	, '1':{'F':'0.03', 'X':'4'}
	, '2':{'F':'0.06', 'X':'4'}
	, '3':{'F':'0.06', 'X':'4'}
	, '4':{'F':'0.11', 'X':'4'}
	, '5':{'F':'0.2', 'X':'10'}
	, '6':{'F':'0.2', 'X':'10'}
	, '7':{'F':'0.4', 'X':'10'}
	, '8':{'F':'0.4', 'X':'10'}
	, '9':{'F':'0.5', 'X':'55'}
	, '10':{'F':'0.85', 'X':'110'}
};

var H1_format_type = {
	'1':{'1':'0.17', '2':'0.07', '3':'0.41'}
	, '2':{'1':'0.16', '2':'0.065', '3':'0.37'}
	, '3':{'1':'0.15', '2':'0.06', '3':'0.35'}
	, '4':{'1':'0.14', '2':'0.057', '3':'0.3'}
};	
	//0.07 0.065 0.06  0.057
var I1_format_type = {
	'1':{'1':'0.17', '2':'0.07', '3':'0.41'}
	, '2':{'1':'0.16', '2':'0.065', '3':'0.37'}
	, '3':{'1':'0.15', '2':'0.06', '3':'0.35'}
	, '4':{'1':'0.14', '2':'0.057', '3':'0.3'}
};	

var L1_format_type = {
	'0':{'L':'0', 'D':'0'}
	, '1':{'L':'0.06', 'D':'5'}
	, '2':{'L':'0.11', 'D':'5'}
	, '3':{'L':'0.4', 'D':'8'}
	, '4':{'L':'0.4', 'D':'8'}
	, '5':{'L':'0.85', 'D':'110'}
};								
	
var M1_format_type = {
	'1':{'2':'0.24','4':'0.22','8':'0.2'}
	, '2':{'2':'0.3','4':'0.25','8':'0.2'}
};









var FM_digital = {
	'0.12':{'FM':'1'}
	,'0.13':{'FM':'1'}
	,'0.15':{'FM':'1'}
	,'0.17':{'FM':'1'}
	,'0.2':{'FM':'1'}
	,'0.22':{'FM':'2'}
	,'0.26':{'FM':'2'}
	,'0.34':{'FM':'2'}
	,'0.45':{'FM':'2'}
	,'0.095':{'FM':'1'}
	,'0.138':{'FM':'1'}
	,'0.21':{'FM':'1'}
	,'0.27':{'FM':'2'}
};
		

function build_calculator(params) {
	var total_sum = 0;
	//( ((params['A']+(params['D']*params['C']))*params['F'])+params['E'] );
	if (params['CLC'] == 1) {
		//Офсетов печат (големи тиражи)
/*		
Y=(Q/(T/2) (ТУ за корица)				
цена за печат на корица=((B+C)*V)+D				
цена за хартия на корица=((Y+R)/4)*E				
покритие на корица=((Y+(R/3))*F)+X				
Z=G/T (коли 35х50)				
цена за печат на тялото=(((H+I)*W)*Z)+J			

[14:24:16] Valio: цена за печат на тялото=(((H+I)*W)*(Z/2))+J
	
цена за хартия на тялото=(((Q+U)/4)*(Z/2))*К				
цена за покритие на тялото=(((Q+(U/3))*(Z/2))*L)+XX				
цена за работа=(((G/(T*2))*0,007)*Q)+(Q*M)				
цена за предпечат=(O*G)+N+(P*Z)				
*/		
		
	var Y = 0;
	var print_cover_price = print_paper_price = print_cover_price1 = Z = print_body_price = print_body_paper_price = 0;
	var print_cover_body_price = print_work_price = print_prepress_price = 0;
	
	Y = params['Y'];
	//params['Y'];
	print_cover_price = (((params['B']+params['C'])*params['V'])+params['D']);

	print_paper_price = (((Y+params['R'])/4)*params['E']);
	print_cover_price1 = (((Y+(params['R']/3))*params['F'])+params['X']);
	Z = (params['G']/params['T']);
	print_body_price = ((((params['H']+params['I'])*params['W'])*(Z/2))+params['J']);
	
	print_body_paper_price = ((((params['Q']+params['U'])/4)*(Z/2))*params['K']);
	
	print_cover_body_price = ((((params['Q']+(params['U']/3))*(Z/2))*params['L'])+params['XX']);
	
	if (params['FM'] == 2) {
		//цена за работа=(((G/(T*2))*0,014)*Q)+(Q*M)
		print_work_price = ((((params['G']/(params['T']*2))*0.010)*params['Q'])+(params['Q']*params['M']));
	} else {
		print_work_price = ((((params['G']/(params['T']*2))*0.004)*params['Q'])+(params['Q']*params['M']));
	}
	
	print_prepress_price = ((params['O']*params['G'])+params['N']+(params['P']*Z));
	
	
	total_sum = (((print_cover_price + print_paper_price + print_cover_price1 + print_body_price + print_body_paper_price + print_cover_body_price + print_work_price)*params['Z1'])+print_prepress_price)
/*
	var info  = 'Y: '+Y+'<br>'+
	'print_cover_price: '+print_cover_price+' | ((('+params['B']+'+'+params['C']+')*'+params['V']+')+'+params['D']+')<br>'+
	'print_paper_price: '+print_paper_price+'<br>'+
	'print_cover_price1: '+print_cover_price1+'<br>'+
	'Z: '+Z+'<br>'+
	'print_body_price: '+print_body_price+'<br>'+
	'print_body_paper_price: '+print_body_paper_price+'<br>'+
	'print_cover_body_price: '+print_cover_body_price+'<br>'+
	'print_work_price: '+print_work_price+'<br>'+
	'print_prepress_price: '+print_prepress_price+'<br>';
	add_msg(info,MSG_INFO);
	*/
	} else if (params['CLC'] == 2) {
		//Дигитален печат (малки тиражи)

/*
Y=(Q/(T/2) (ТУ за корица)				
цена за печат на корица=(B+C)*Q				
цена за хартия на корица=((Y+4)/4)*E				
покритие на корица=((Y+4)*F)+X				
Z=G/T (коли A3)				
цена за печат на тялото=((H+I)*(Z/2)*Q				
цена за хартия на тялото=((Q+4)*(Z/2))*(К/4)				
цена за покритие на тялото=(((Q+4)*(Z/2))*L)+D				

цена за работа=(((G/(T*2))*0,006)*Q)+(Q*M) 
Ако К е над 150 гр. Формулата за цена за работа става:  
цена за работа=(((G/(T*2))*0,012)*Q)+(Q*M)
				
цена за предпечат=(O*G)+N+(P*Z)				

*/	
	var Y = 0;
	var print_cover_price = print_paper_price = print_cover_price1 = Z = print_body_price = print_body_paper_price = 0;
	var print_cover_body_price = print_work_price = print_prepress_price = 0;
	
	Y = params['Y'];
	//params['Y'];
	print_cover_price = ((params['B']+params['C'])*params['Q']);

	print_paper_price = (((Y+4)/4)*params['E']);
	print_cover_price1 = (((Y+4)*params['F'])+params['X']);
	Z = (params['G']/params['T']);
	print_body_price = ((params['H']+params['I'])*(Z/2)*params['Q']);
	
	print_body_paper_price = (((params['Q']+4)*(Z/2))*(params['K']/4));
	
	print_cover_body_price = ((((params['Q']+4)*(Z/2))*params['L'])+params['D']);
	
	if (params['FM'] == 2) {
		//цена за работа=(((G/(T*2))*0,014)*Q)+(Q*M)
		print_work_price = ((((params['G']/(params['T']*2))*0.012)*params['Q'])+(params['Q']*params['M']));
	} else {
		print_work_price = ((((params['G']/(params['T']*2))*0.006)*params['Q'])+(params['Q']*params['M']));
	}
	
	print_prepress_price = ((params['O']*params['G'])+params['N']+(params['P']*Z));
	
	
	total_sum = (((print_cover_price + print_paper_price + print_cover_price1 + print_body_price + print_body_paper_price + print_cover_body_price + print_work_price)*params['Z1'])+print_prepress_price)

	var __info = 'цена за печат на корица= '+print_cover_price+'<br>';
			__info += 'цена за хартия на корица= '+print_paper_price+'<br>';
			__info += 'Y='+Y+'<br>';
			__info += 'покритие на корица= '+print_cover_price1+'<br>';
			__info += 'Z= '+Z+'<br>' ;
			__info += 'цена за печат на тялото= '+print_body_price+'<br>';
			__info += 'цена за хартия на тялото= '+print_body_paper_price+'<br>';
			__info += 'цена за покритие на тялото= '+print_cover_body_price+'<br>';
			__info += 'цена за работа= '+print_work_price+'<br>';
			__info += 'цена за предпечат= '+print_prepress_price+'<br>';
			__info += 'total = '+total_sum+'<br>';
//	add_msg(__info,MSG_INFO);
	} else {
		return false;
	}
	var singel_sum = total_sum/params['Q'];
	var vat_sum = (((20.0+100)/100)*total_sum);
	
	$('#single_sum').html(roundNumber(singel_sum, 2)+' лв/бр');
	$('#sum_total').html(roundNumber(total_sum, 2)+' лв');
	$('#sum_vat_total').html(roundNumber(vat_sum, 2)+' лв');

return false;
//	add_msg(html,MSG_SUCCESS);
}//build_calculator


function roundNumber(num, dec) {
	var result = Math.round(num*Math.pow(10,dec))/Math.pow(10,dec);
	if(result.toString().indexOf(".") == -1) result = result+'.00';
	return result; //parseFloat(result);
}
